{
"quizz_cybersecurity" : [
    "What is the name of the technique where an attacker impersonates a trusted entity to obtain sensitive information? ||Phishing||",
    "Which secure network protocol uses port 443 to encrypt web communications? ||HTTPS (HyperText Transfer Protocol Secure)||" ,
    "What does the acronym 'DDoS' stand for in the context of network attacks? ||Distributed Denial of Service||",
    "What term describes malware that encrypts a user's data and demands a ransom to unlock it? ||Ransomware||",
    "What is the main function of a 'firewall'? ||To filter and control incoming and outgoing network traffic based on established security rules.||",
    "What type of web vulnerability allows an attacker to inject SQL commands into a database? ||SQL Injection||",
    "In cryptography, what is the term for converting plaintext into an unreadable format? ||Encryption||",
    "What is a common method for authenticating users that requires two different types of verification (e.g., password and code sent to phone)? ||Two-Factor Authentication (2FA) or Multi-Factor Authentication (MFA)||",
    "What is the principle that dictates a user should only have access rights strictly necessary to perform their job? ||Principle of Least Privilege (PoLP)||",
    "What type of attack involves capturing and inspecting network traffic? ||Sniffing or Eavesdropping||",
    "What is the primary goal of a 'Zero-Day' exploit? ||To exploit a vulnerability that is unknown to the software vendor, giving them zero days to fix it before the attack.||",
    "Which security measure uses behavioral analysis and patterns to detect internal threats? ||SIEM (Security Information and Event Management) or UEBA (User and Entity Behavior Analytics)||",
    "What is the name of the file or record that stores the history of a user's actions on a system? ||Audit log or Access log||"
],
"quizz_hardware" : [
    "Which unit of measurement expresses the clock speed of a processor? ||Hertz (Hz) or Gigahertz (GHz)||" ,
    "In an electronic circuit, which component is capable of storing an electrical charge and is measured in Farads? ||The Capacitor||",
    "Which component is considered the basic building block of digital electronics, acting as a controlled switch? ||The Transistor|| ",
    "What is the role of 'RAM' (Random Access Memory) in a computer? ||To temporarily store data and programs currently being executed for the processor.||",
    "What fundamental law relates Voltage (U), Current (I), and Resistance (R) in electronics? ||Ohm's Law ($U = R \times I$)||" ,
    "Which type of integrated circuit is at the heart of a computer and executes program instructions? ||The CPU (Central Processing Unit) or Processor||",
    "Which serial communication bus is commonly used to connect external peripherals like mice, keyboards, and external hard drives? ||USB (Universal Serial Bus)||",
    "What is the main function of the 'GPU' (Graphics Processing Unit)? ||To quickly process complex graphical calculations, and increasingly, parallel computations for AI or scientific calculations.||",
    "What electronic component is used to convert Alternating Current (AC) into Direct Current (DC)? ||The Diode (specifically, in a rectifier circuit)||",
    "Which component is necessary to ensure that the CPU remains at an acceptable temperature under load? ||The Heat Sink (and/or Fan)||",
    "What is the difference between volatile and non-volatile memory? ||Volatile memory (like RAM) loses its data when power is removed, while non-volatile memory (like ROM, SSD) retains it.||",
    "In electronics, what is a 'pull-up' or 'pull-down' resistor used for? ||To ensure that a digital input pin has a defined state (HIGH or LOW) when no external signal is applied.||",
    "What is the name of the circuit board that connects all the computer components (CPU, RAM, GPU, etc.)? ||The Motherboard or Mainboard||"
],
"quizz_software" : [
    "Which data structure uses the 'LIFO' (Last-In, First-Out) principle? ||The Stack||",
    "In Object-Oriented Programming (OOP), what does 'Inheritance' mean? ||The mechanism by which one class acquires the properties and methods of another class (its parent class).||",
    "What is the primary role of a 'compiler'? ||To translate source code written in a high-level language into machine language (binary code) executable by the processor.||",
    "What is an 'infinite loop' in programming? ||A sequence of instructions that repeats indefinitely without a termination condition.||",
    "What does the acronym 'API' stand for? ||Application Programming Interface||",
    "In Python, what is the standard method for adding an item to the end of a list? ||.append()||",
    "Name the three pillars of Object-Oriented Programming (OOP). ||Encapsulation, Inheritance, Polymorphism.||",
    "What is the standard text-based markup language used to structure content on the World Wide Web? ||HTML (HyperText Markup Language)||",
    "What is the difference between a high-level language (like Python) and a low-level language (like Assembly)? ||A high-level language is easier for humans to read and write, while a low-level language is closer to the processor's native instructions.||",
    "Which structure allows executing a different block of code depending on a condition (e.g., A > B)? ||The Conditional Structure (e.g., if/else statement)||",
    "What is the data structure that uses the 'FIFO' (First-In, First-Out) principle? ||The Queue||",
    "In programming, what is the process of finding and fixing errors or bugs in source code? ||Debugging||",
    "What is the name of the technique where a function calls itself? ||Recursion||"
],
"quizz_networking" : [
    "What is the most common layered model used to describe network communications? ||TCP/IP Model|| ",
    "What does an 'IP address' represent? ||A unique identifier assigned to every device connected to a network that uses the Internet Protocol.||",
    "What is the role of 'DNS' (Domain Name System)? ||To translate human-readable domain names (e.g., google.com) into numerical IP addresses.||",
    "Which simple messaging protocol is commonly used for sending emails? ||SMTP (Simple Mail Transfer Protocol)||" ,
    "What is the fundamental difference between HTTP and HTTPS? ||HTTPS uses encryption (TLS/SSL) to secure communication, unlike HTTP.||",
    "Which network device has the primary function of connecting multiple networks together and directing data packets? ||The Router||",
    "What is the name of the address unique to every network interface card (NIC) and used at the Data Link Layer (Layer 2)? ||MAC Address (Media Access Control Address)||",
    "What is the maximum number of layers in the OSI model (often compared to TCP/IP)? ||Seven (7)||",
    "Which protocol is commonly used to assign an IP address automatically to a device when it connects to a network? ||DHCP (Dynamic Host Configuration Protocol)||",
    "What does 'Latency' mean in the context of networks? ||The delay before a transfer of data begins following an instruction for its transfer.||",
    "What is the difference between a LAN and a WAN? ||A LAN (Local Area Network) covers a small area (e.g., a home or office), while a WAN (Wide Area Network) covers a large geographical area (e.g., the Internet).||",
    "What is the main function of a 'Switch' in a network? ||To connect devices within the same network and forward data frames only to the intended recipient based on MAC addresses.||"
],
"quizz_blockchain" : [
    "What is a 'hash' in cryptography? ||The output of a mathematical function (hashing function) that produces a fixed-size, unique fingerprint for any input data.||",
    "What is the main technical characteristic of a 'blockchain'? ||An immutable, secure chain of data blocks, validated by a peer network and secured by cryptography.||",
    "Which mechanism guarantees both the authenticity and non-repudiation of a digital document? ||Digital signature||",
    "What is the name of the hashing algorithm used by Bitcoin? ||SHA-256||",
    "In the context of blockchains, what does 'PoW' stand for? ||Proof of Work||",
    "What is the purpose of a 'Smart Contract'? ||A self-executing agreement with the terms of the agreement directly written into code on the blockchain.||",
    "What is the name of the process that verifies transactions and adds new blocks to the chain (e.g., on Bitcoin)? ||Mining (or Staking for PoS)||",
    "What principle ensures the security and immutability of the chain through distributed consensus? ||Decentralization||",
    "What is the alternative consensus mechanism to Proof of Work that uses validators who 'stake' their cryptocurrency? ||Proof of Stake (PoS)||",
    "What is the term for the shared, synchronized, and replicated database that forms the blockchain? ||Distributed Ledger Technology (DLT)||",
    "What is a 'fork' in a blockchain? ||A divergence in the chain of blocks, often resulting in two separate versions of the ledger.||"
],
"quizz_3dmodeling" : [
    "What are the three main axes in a standard 3D coordinate system? ||X (width), Y (height), and Z (depth)||",
    "What does the acronym 'CAD' stand for in the context of design and modeling? ||Computer-Aided Design||",
    "What are the three fundamental components (or primitives) that typically define the geometry of a 3D mesh? ||Vertices (points), Edges (lines), and Faces (surfaces/triangles)||",
    "What is the term for applying a 2D image onto the surface of a 3D model to give it color and texture? ||Texturing (or UV Mapping/Texture Mapping)||",
    "In 3D animation, what process is used to define the movement of a character or object over time, often using key positions? ||Keyframing||",
    "What is the name of the technique used to mathematically calculate how light interacts with surfaces in a 3D scene to produce a final image? ||Rendering||",
    "Which type of modeling is based on mathematical curves and surfaces (like Bézier curves) and is often used for high-precision design (e.g., automotive)? ||NURBS Modeling (Non-uniform rational basis spline)||",
    "What is the effect of 'Normal Mapping' in rendering? ||It simulates fine surface details (like bumps or scratches) using a texture map, without actually increasing the geometry (number of polygons).||",
    "What is the process of reducing the number of polygons in a 3D mesh to simplify it for better performance? ||Decimation or Optimization||",
    "What does 'Rigging' involve in 3D character animation? ||Creating a system of bones and joints (a skeleton) and controls to allow the animator to move the character.||"
],
"quizz_webdevelopment" : [
    "What is the purpose of 'CSS' (Cascading Style Sheets)? ||To define the style, layout, and visual presentation of a web page written in HTML.||",
    "Which programming language is essential for making web pages interactive (e.g., dynamic content, form validation)? ||JavaScript||",
    "What does 'DOM' stand for in the context of web browsers? ||Document Object Model||",
    "What is the primary role of a 'front-end' developer? ||To build the part of the website that the user sees and interacts with (the client side).||",
    "What does the acronym 'SQL' stand for? ||Structured Query Language||",
    "What is the term for a library or framework that allows executing JavaScript code on the server side (not in the browser)? ||Node.js (or any Server-Side JavaScript Runtime)||",
    "What are the two most common HTTP request methods used for client-server communication (e.g., to retrieve or submit data)? ||GET and POST||",
    "What is a 'responsive' design in web development? ||A design that automatically adjusts the layout and elements to fit the screen size of the user (desktop, tablet, mobile).||",
    "What is the term for the storage mechanism that allows a website to save small pieces of information in the user's browser? ||Cookies or Local Storage||",
    "What is the primary function of a 'version control system' (like Git) in development? ||To track and manage changes to code over time, allowing multiple developers to collaborate without conflict.||",
    "What is a 'Transpiler' (or Source-to-Source Compiler) often used for in modern web development? ||To convert code written in a newer version of a language (e.g., ES6+ JavaScript, TypeScript) into an older version that is compatible with all browsers.||"
],
"quizz_general" :[
    "What is the programming language most often used to style the look and feel of web pages (colors, fonts, layout)? ||CSS (Cascading Style Sheets)||" ,
    "Who invented the World Wide Web (WWW)? ||Tim Berners-Lee||",
    "Which operating system is based on the Linux kernel and is very popular among developers? ||GNU/Linux (e.g., Ubuntu or Debian)||" ,
    "What concept describes the practice of entrusting the hosting and execution of applications to remote servers via the Internet? ||Cloud Computing||",
    "Which software development methodology emphasizes rapid delivery and adaptation to change through short, iterative cycles (sprints)? ||Agile Methodology (e.g., Scrum)||",
    "Which software tool allows managing code versions and is essential for teamwork (e.g., commit, push, pull)? ||Git||",
    "What is the fundamental difference between Direct Current (DC) and Alternating Current (AC)? ||DC flows in one direction only, while AC periodically reverses direction.|| ",
    "What acronym represents a virtualization technology for packaging an application and its dependencies to ensure it runs reliably in any environment? ||Docker (or Containerization)||" ,
    "What is a common unit of measurement for electrical energy consumption? ||Watt-hour (Wh) or Kilowatt-hour (kWh)||",
    "What is the name of the set of principles governing the design of a user interface to make it intuitive and efficient? ||User Experience (UX) and User Interface (UI) Design||",
    "What is the 'Moore's Law' primarily about in the context of microelectronics? ||The observation that the number of transistors on a microchip doubles approximately every two years.||",
    "What are the two main types of virtualization commonly used today? ||Hardware virtualization (e.g., Virtual Machines) and Operating System virtualization (e.g., Containers/Docker)||",
    "What term describes the mathematical field that studies the efficient manipulation of data and algorithms? ||Computer Science (or Algorithmic Theory)||",
    "In the context of the environment, what does the acronym 'IoT' stand for? ||Internet of Things||"
]
}